corpus = """제1조(목적)
이 약관은 SK텔레콤(이하 "회사") '내가고른패키지'(이하 "패키지") 상품 가입, 이용 및 해지에 관한 기본적인 사항을 정함을 목적으로 합니다.

제2조(약관의 적용)
회사의 패키지 상품을 이용할 때에는 이 약관과 함께 회사 및 각 상품별 제휴사 이용약관(이하 "개별약관")을 적용합니다. 단, 이 약관, 개별약관 사이에 상충되는 내용이 있는 경우, 이 약관, 개별약관의 순으로 적용합니다.

제3조(용어의 정의)
개별 약관에서 정의한 용어 이외 이 약관에서 사용하는 용어의 정의는 다음과 같습니다.

① 패키지 상품 : '내가고른패키지' 출시(2018. 10. 18.) 이후 회사 및 회사의 대리점·판매점을 통하여 회사에서 지정한 상품을 2개 이상 가입하여 이용하는 상품으로 고객의 자율 의사에 따라 선택이 가능함
② 제휴사 : 패키지 상품을 이용하는 고객에게 요금할인 등 패키지 혜택을 제공하는 사업자
③ 패키지 혜택 : 회사 또는 제휴사가 패키지 상품 이용기간 동안 이용자에게 제공하는 요금할인 또는 기타 모든 경제적인 이익 및 이용 편의
④ 메인 상품 : 패키지 혜택을 받기 위해 회사가 지정한 상품 중 1개 이상 반드시 선택해야 하는 상품
⑤ 제휴 상품 : 패키지 상품에 포함되는 상품으로서 SK텔레콤 이동전화를 이용하는 경우에만 가입이 가능한 상품
제4조(패키지 상품 이용조건)
① 패키지 상품은 회사에서 지정한 2개 이상의 상품을 이용 하여야만 패키지 혜택을 제공 받을 수 있으며, 2개 상품 중 1개의 상품은 회사가 지정한 메인 상품을 반드시 선택하여 이용하여야 합니다.
② 메인 상품과 제휴 상품은 회사가 인터넷사이트(새창열림www.tworlddirect.com)에 게시하며, 회사의 사정 또는 제휴사와의 계약관계에 의하여 추가 또는 삭제될 수 있으며 변동사항이 있을 경우 별도 공지합니다.
③ 패키지 혜택은 SK텔레콤 이동전화를 이용하고 있어야 제공이 가능하며, SK텔레콤 이동전화의 해지 시 패키지 혜택은 자동으로 소멸됩니다.
④ 패키지 상품 출시 이전 메인 상품 또는 제휴 상품을 이용하고 있는 경우에는 패키지 혜택이 제공되지 않습니다.
⑤ 메인 상품이 전부 해지될 경우 패키지 혜택은 제공이 중단되며, 메인 또는 제휴 상품 해지에 따른 위약금 규정은 개별 상품 약관에 따릅니다.
⑥ 메인 상품 전부 해지 시 제휴 상품은 자동 해지 될 수 있습니다.
⑦ 구성상품별 개통 또는 설치가 필요한 경우는 모든 구성 상품의 개통이 완료된 때로부터 패키지 혜택 제공이 가능합니다.
제5조(이용신청 방법)
① 이용자는 영업점 방문 또는 고객센터 전화상담을 통해 패키지 상품을 신청(또는 청약)을 할 수 있습니다.
② 이용자가 이용계약(신청)을 체결하기 위해서는 개별상품 가입신청서와 개별상품 이용약관에 반영된 가입신청 구비서류를 제출하여야 하며, 회사는 제출된 관련 청약증빙자료(가입신청서, 구비서류 녹취 등)를 보관할 수 있습니다.
③ 대리인이 제1항에 의거 신청할 경우, 회사는 이용자 본인에게 위임 여부를 대면, 전화, 서면 등의 방법으로 확인 할 수 있습니다.
제6조(신청의 승낙)
① 회사는 이용자에게 다음 각 호의 내용에 대한 설명을 하고 가입신청서에 이를 기재한 후 확인 서명을 받아야 합니다(전자서명 포함). 다만, 이용자가 전화 녹취에 동의한 경우에는 전화 녹취의 방법으로 대신할 수 있습니다.
패키지 상품 가입에 따른 고객 혜택(상품별 할인금액 포함)
메인 또는 제휴 상품 해지 및 혜택 중단 기준
② 이용자의 청약에 대한 회사 및 제휴사의 승낙은 이용계약서(신청서) 교부로 합니다.
③ 전화 및 인터넷 계약 신청의 경우에는 전화 녹취로 제1항의 설명 및 이용계약서(신청서)를 대신 할 수 있으며, 이 경우 이용계약서는 SMS, 이메일 등의 방법으로 별도 교부합니다.
④ 회사는 패키지 상품 가입 사실, 서비스 개시일 등에 대한 정보를 이용자에게 청구서 등의 방법으로 통지할 수 있습니다.
제7조(이용신청 승낙의 제한)
① 회사는 이용자의 청약에 대하여 업무 수행상 지장이 있다고 판단되는 다음 각 호의 경우에는 승낙을 제한(또는 유보)하고, 이를 이용자에게 통지합니다.
패키지 상품을 구성하고자 하는 개별 상품(이하 "패키지 대상 상품") 및 SK텔레콤 이동전화 서비스가 이용정지 등으로 정상적으로 이용할 수 없는 경우
패키지 대상 상품이 개별 상품 이용약관에 명시된 승낙제한의 사유에 해당되어 서비스를 제공할 수 없는 경우
② 회사는 이용자의 청약에 대하여 제6조 ①항의 이행을 하지 못한 정당한 사유가 있는 경우 승낙제한(또는 유보)하고, 이를 전화, SMS 등의 방법으로 이용자에게 통지합니다.
제8조(이용계약의 증명사항 열람)
① 이용계약사항에 대하여 이용자 본인이나 그로부터 위임 받은 자 또는 법원의 확정판결서나 공정증서를 제시한 이해관계인은 회사에 대하여 증명 또는 열람 청구를 할 수 있습니다.
② 회사는 요금 정산, 오납 등 분쟁에 대비하여 해지 후 6 개월까지 이용계약서를 보관하며, 고객이 열람을 원할 경우 본인 확인절차를 거쳐 열람 할 수 있습니다. (요금정산이 미완료된 경우 완료일로부터 6개월 보관하며 단, 보관 내용 및 기간이 별도로 명시된 경우는 해당 조항을 우선적으로 적용할 수 있음)
제9조(계약사항의 변경신청 및 제한)
① 이용자는 결합서비스의 계약내용을 변경하고자 하는 경우 회사에 신청하여 승낙을 받아야 합니다.
② 제①항과 관련하여 다음 각 호의 하나에 해당하는 경우 이를 승낙하지 않을 수 있습니다.
이용자가 요금 등을 미납하였을 경우
기술상 서비스 제공이 어려운 경우
이 약관 (개별약관 포함) 규정을 충족하지 못한 경우
③ 회사의 사정 변경 또는 제휴사와의 계약관계 변경 및 해지에 따라 패키지 상품 신규가입 중단, 폐지 및 혜택 감소 시 그 내용을 특별한 사정이 없는 한 최소 1 개월 전에 홈페이지를 통하여 안내하고, 해당 변경사항을 적용 받는 이용자에게는 청구서(이메일, SMS 등)를 통하여 통지합니다.
제10조(이용정지)
① 회사는 패키지 상품 이용자가 약관을 위반하는 경우와 요금을 미납했을 경우에 개별약관에서 정하는 바에 따라 패키지 상품 일부 또는 전부에 대하여 일정 기간 동안 서비스의 이용을 정지 또는 해지할 수 있습니다.
② 회사는 패키지 상품의 일부 또는 전부에 대하여 미납으로 인한 이용정지 기간 동안에는 패키지 혜택을 제공하지 않습니다.
제11조(해지)
① 이용자는 패키지 상품 전부 또는 일부를 해지할 경우 영업점 방문, 전화, 팩스 또는 우편 등의 방법으로 회사에 신청하여야 하며, 일부 제휴 상품은 해당 제휴사에 직접 신청하거나 영업점에 직접 방문하여야 합니다.
② 회사는 다음 각 호의 사유로 패키지 상품의 일부가 변경 또는 해지되어 이용자의 잔여 상품으로 패키지를 구성하지 못하는 경우 직권으로 패키지 상품을 해지할 수 있습니다.
양도, 승계, 명의변경을 한 경우
SK텔레콤 이동전화를 해지 한 경우
타사의 이동전화로 번호이동을 한 경우
회사가 이 약관(개별약관 포함)에 따라 패키지 상품 일부를 직권으로 해지하여 제4조에 의거 패키지 이용조건을 충족하지 못한 경우
기타 계약자의 사유로 인한 일부 상품이 해지된 경우
제12조(패키지 혜택 제공 중단에 따른 효력)
① SKT 제휴패키지를 구성하는 개별/전체 상품 해지, 이동전화 해지/명의변경, 이용정지 등의 사유가 발생한 경우 패키지 혜택 제공이 중단됩니다.
② 위 1항에 따라 패키지 혜택 제공이 중단되는 경우 익월부터는 패키지 혜택이 제공되지 않은 요금이 청구됩니다. 다만, 개별상품의 조건에 따라 메인 또는 제휴 상품이 자동해지 될 수 있습니다.
제13조(이의신청 및 처리)
① 회사가 청구한 패키지 상품 요금에 이의가 있는 경우 이용자는 청구일로부터 6개월 이내에 이의신청을 할 수 있으며, 회사는 조사 후 정당하다고 인정되는 경우에는 그 차액을 정산합니다. 다만, 회사의 귀책사유로 과오납이 발생한 경우, 이용자는 본문에도 불구하고 언제든지 청구된 요금에 대하여 이의신청을 할 수 있습니다.
② 회사는 제①항의 이의신청에 대하여 접수 후 즉시 이의타당성 여부를 조사하고, 그 결과를 10일 이내에 이용자 또는 그 대리인에게 통지하며, 부득이한 사유로 인하여 정한 기간 내에 이의신청 결과를 통지할 수 없는 경우에는 그 사유와 처리기한을 명시하여 통지합니다.
제14조(패키지 상품의 이용고객 정보제공)
① 회사는 원활한 패키지 상품 제공을 위하여 패키지 대상 상품을 제공하는 사업자(제휴사 포함)에게 이용자의 정보를 해당 이용자의 동의를 받아 제공할 수 있습니다.
② 회사는 패키지 대상 상품을 제공하는 사업자(제휴사 포함)에게 최소한의 고객정보에 한하여 제공하며, 고객정보의 유출로 인한 피해가 없도록 최선을 다합니다.
제15조(책임소재)
③ 패키지 상품 이용기간 동안 이용자의 책임 없는 사유로 이용자가 손해를 입은 경우 회사에 손해배상을 청구할 수 있습니다. 다만, 개별 상품에 의한 손해에 대하여는 해당 상품 제공사업자(제휴사 포함)에게 손해배상 책임이 있습니다.
제16조(손해배상의 범위 및 청구)
① 회사는 이용자의 책임 없는 사유로 패키지 혜택을 제공받지 못하여 손해를 입은 경우에는 이용자의 청구에 의하여 이를 배상합니다.
② 패키지 상품 손해배상의 기준 및 범위는 패키지 구성상품별 개별약관에 명시된 손해배상 기준을 따릅니다.
<부칙>
부 칙 (2018.10.18 시행)
제1조[시행일] 이 약관은 2018년 10월 18일부터 시행합니다."""



from semantic_router.splitters import RollingWindowSplitter
from semantic_router.encoders import FastEmbedEncoder
encoder = FastEmbedEncoder(name="intfloat/multilingual-e5-large")
# encoder = FastEmbedEncoder(name="snowflake/snowflake-arctic-embed-s")

splitter = RollingWindowSplitter(
        encoder=encoder,
        window_size=500,  # Compares each element with the previous one
        min_split_tokens=700,
        max_split_tokens=1000,
        plot_splits=True,
    )

error_cnt = 0
final = []

print(' [청킹전] 총 문장 수 : ',len(corpus))
splits = splitter(corpus)
print(' [청킹후] 총 문장 수 : ',len(splits))
chunked_list = []
for idx in range(len(splits)):
    chunked = '\n'.join(splits[idx].docs)
    chunked_list.append(chunked)
for c in chunked_list:
    print(c)
    print('-'*20)
